[
  {
    "id": "problem-framing-better-way-to-solve",
    "title": "Problem Framing: A Better Way To Solve The Problem",
    "slug": "problem-framing-better-way-to-solve",
    "published": "2023-12-17T04:55:00.000Z",
    "content": "<img src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEh-p9Rf8zO9Ueqv3A3D7zK4JsZgvAyr3E9Eh7hwaWNKDazYlgnVs_HzrelXb_Em_DoL-cqx4Oqxz2gImskzYlBmab1Eroyxw_3QRiayCFM360Cl4NE9cxCvs7SZRuWG6Q6Ne7mheocW1ME7-ifOvK1nSsP_uxO8k65hmhWR5AQ5dbYqtTaINOZTBKzGu21t/w200-h153/Problem%20Framing.jpg\" style=\"display: none;\" />\n<p>Imagine you visit a doctor and say, “Doctor, I am not feeling well.” Without any diagnosis, the doctor prescribes you some medicine and asks you to return after a few days. How do you know if the medicine is suitable for you?</p><p>But what if you tell the doctor that you are not feeling well and the doctor starts understanding your problem by asking questions about your food, your lifestyle, the severity of the issue, and the source of the pain, and then explains the medicine? I hope that could help to fill the gap sooner than in the first case.</p><p>If you consider both the analogies, then there is one factor that is constant. That factor is going to the root of the problem, which is framing the problem. Many times, when a problem arises, we start solving it right away without examining it, understanding its pattern, and framing the right problem to solve. This is called the question-zero state of the problem. We mistake the outcome of the problem for the problem itself. Not feeling well is the outcome, but the real problem might be low WBC count or something else.</p><p>There are three things that should be considered for framing the problem</p><p></p><ol style=\"text-align: left;\"><li>The goal or objective: What are you trying to achieve or improve?</li><li>The use case: Who are the users or customers of your solution?</li><li>The real issue: What is the root cause or the pain point of the problem?</li></ol><p></p><p>Let’s take the example of “How would you improve Google Maps?”</p><p></p><ul style=\"text-align: left;\"><li>Outcome: improve Google Maps</li><li>Goal or objective: To increase revenue, engagement, or market share for Google Maps.</li><li>Use case: travellers, shop owners, students, etc.</li><li>Uncover real issue: finding the warehouse location, finding the unknown place, etc.</li></ul><p></p><p>After reframing the problem into question zero, the effective question looks like: “How can we increase user engagement by 10% in 6 months by finding the optimal warehouse location for the brick-and-mortar shoppers who want to access the items they need?”</p><p>Question zero is the process where we frame the problem to its root and solve the root problem. <b>Hence, problem solving starts with effectively framing the right problem.</b></p><div class=\"content\" tabindex=\"0\"><cib-overlay></cib-overlay></div>",
    "excerpt": "Imagine you visit a doctor and say, “Doctor, I am not feeling well.” Without any diagnosis, the doctor prescribes you some medicine and asks you to return after a few days. How do you know if the medi...",
    "canonicalUrl": "https://blog.rajkawale.com/2023/12/problem-framing-better-way-to-solve.html",
    "tags": [
      "Product Management"
    ]
  },
  {
    "id": "the-paradoxical-power-of-habit",
    "title": "The Paradoxical Power of Habit: Cigarettes as a Product Case Study",
    "slug": "the-paradoxical-power-of-habit",
    "published": "2025-12-04T12:31:00.000Z",
    "content": "<img src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi41ZlFWmJ7W_I9x3ACLsu4rclN6sT25mvzFnS9nOhV0nFdGLpEwXCx-cPr3rH1Mp9g8xzqHXvMLtwEb8MGWubzxJOSpHtlYJ8wfLNY33gOOeZzdB1WuRkUiZBO9YWc6pao-7e_wMZFm528v33eqOV3VlCBojjWaqF4P2tEBFtbdKtXsXM5LThQZIbx54OZ/s4191/pexels-omar-alnahi-18496.jpg\" style=\"display: none;\" />\n<div class=\"separator\">Whenever I engage in a conversation with a product leader, a recurring question arises: <b>\"What's your favorite product?\"</b></div><br />More often than not, I gravitate towards products that solve real problems, stand out with their honesty, demonstrate innovation, and adhere to the Rams 10 design principle. Yet, despite all these criteria, the cigarette remains a product that endlessly intrigues me. While I've hardly smoked, the unwavering demand for cigarettes in the market has always captured my attention.<br /><br />Cigarettes challenge our conventional understanding of product success. Despite the glaring health warnings and alarming images plastered on every pack, millions worldwide are unwavering in their loyalty. It isn't the brand messaging or user experience that captivates my curiosity. Instead, <b>it's the undeniable force of habit.</b><br /><br /><b>Dive into the Numbers:</b><br />India, with its sprawling demographics, provides a unique perspective on this trend. Data from 2016-17 hints at nearly 19 million smokers in the nation. However, for a more updated view, we should consider the World Health Organization's data from 2018.<br /><br />According to this data, the percentage of smokers in India was 13.4% (men 20.6%; women 5.9%). Assuming that this percentage is constant across all age groups, we can estimate the number of smokers in India by multiplying it by the population of each age group. Based on the data from Worldometer, the people of India in 2023 are projected to be 1.4 billion and the age distribution is as follows:<br /><br />0-14 years: 25.69% (0.37 Billion people)<br />15-64 years: 67.51% (0.96 Billion people)<br />65 years and above: 6.8% (0.097 Billion people)<br /><br />Using these numbers, we can estimate the number of smokers in each age group as follows<br />0-14 years: 13.4% of 0.37 Billion = 0.05 Billion smokers<br />15-64 years: 13.4% of 0.96 Billion = 0.13 Billion smokers<br />65 years and above: 13.4% of 0.097 Billion = 0.0130 Billion  smokers<div><br />The total number of smokers in India is then estimated to be:&nbsp;<b>0.2 Billion smokers</b><br /><br /><b>Habit's Stranglehold:</b></div><div><div>What can we learn from the persistent popularity of cigarettes?&nbsp;<div>The key takeaway is clear yet profound: the dominant role of habit in driving product loyalty. It's not always the groundbreaking or user-centric products that dominate the market, but rather those that seamlessly integrate into the daily lives of consumers.<br /><br />In multiple areas of our lives, our choices aren't determined by what's best, but by what's familiar. This pattern isn't exclusive to tobacco but is evident in various consumer behaviors.<br /><br /><b>The Financial Reality:</b><br />Beyond the well-known health implications, the economic impact of smoking is pronounced when projected over a lifetime. In India, the pricing dynamics of cigarettes fluctuate due to factors such as brand and quality, leading to an average cost ranging from ₹99 to ₹289 per pack of 20 cigarettes.</div><div><br />&nbsp;Given the backdrop of the average life expectancy of Indian smokers — 38.5 years for men and 42.4 years for women — and assuming the initiation age of 18, we can derive the following lifetime expenditure on cigarettes:<br /><br /><b>For Men</b><br />- Starting Age: 18 years<br />- Average Life Expectancy: 38.5 years<br />- Years of Smoking 20.5 years<br /><br />  -At a rate of ₹99  per pack<br />[ (38.5 - 18) * 365 * 99.23 ]<br />    This culminates in an expenditure of approximately ₹748,386.<br /><br />  - At a rate of ₹289.42 per pack<br />[ (38.5 - 18) * 365 * 289.42]<br /></div><div>The expenditure escalates dramatically to ₹2,161,117<br /><br /><b>For Women:</b><br />Starting Age: 18 years<br />Average Life Expectancy: 42.4 years<br />Years of Smoking: 24.4 years<br /><br />  - At a rate of ₹99 per pack<br />[(42.4 - 18) 365 * 99.23 ]<br />    This results in a lifetime spend of about ₹884,021.<br /><br />-At a rate of ₹289.42 per pack <br />[(42.4 - 18) *  365 * 289.42 ]<br /></div><div>The investment inflates significantly to ₹2,562,061.<br /><br /><b>In Conclusion:</b></div><div><b><br /></b>When faced with the age-old question about my favorite product, my answer unerringly points to cigarettes. Not as an affirmation of their value, but as a remarkable case study in understanding human tendencies in product consumption. <br /><br /><b>The crux of product success isn't just about innovation; it's about embedding products into the daily routines of consumers. In the grand race of market dominance, it isn't the best product that wins but the one that has mastered the art of habit formation.</b><br /><br /><br />PS: This article delves into product management insights and the dynamics of human behavior.<br /><br /><p></p></div><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><br /></div><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><br /></div><br /></div></div>",
    "excerpt": "Whenever I engage in a conversation with a product leader, a recurring question arises: \"What's your favorite product?\"More often than not, I gravitate towards products that solve real problems, stand...",
    "canonicalUrl": "https://blog.rajkawale.com/2023/09/the-paradoxical-power-of-habit.html",
    "tags": [
      "Case Study",
      "Product Management"
    ]
  },
  {
    "id": "life-is-here-and-now",
    "title": "Life is here and now",
    "slug": "life-is-here-and-now",
    "published": "2023-08-16T14:39:00.000Z",
    "content": "<br /><br /><br /><div><table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhTyf-vAqyVbhQ7luiFRLvhy8eo0lO2t7fzLngPCoYfNz4P23hnFO8X9n7AWmo9zCJ2WJM5PbUYt_rgHricC88KJ4bT7KNz1y8hu98AWb-IGQuwQE5r7Dajtjwqut53i2bkcozEV9kRORYs1GTEAtDRVnHU4B6ScPCmcvyhhGpSV55iGJGyXwhOs0YLm7MH/s2016/raj_in_rain.jpg\" style=\"margin-left: auto; margin-right: auto;\"><img border=\"0\" data-original-height=\"2016\" data-original-width=\"1728\" height=\"320\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhTyf-vAqyVbhQ7luiFRLvhy8eo0lO2t7fzLngPCoYfNz4P23hnFO8X9n7AWmo9zCJ2WJM5PbUYt_rgHricC88KJ4bT7KNz1y8hu98AWb-IGQuwQE5r7Dajtjwqut53i2bkcozEV9kRORYs1GTEAtDRVnHU4B6ScPCmcvyhhGpSV55iGJGyXwhOs0YLm7MH/s320/raj_in_rain.jpg\" width=\"274\" /></a></td></tr><tr><td class=\"tr-caption\" style=\"text-align: center;\"><br /></td></tr></tbody></table><br /></div><div><br /></div><div><br /></div><div> A drop of rain lands on my face<div>It feels cold and warm, a sign of grace&nbsp;</div><div>It slides down from my head to my feet&nbsp;</div><div>It makes me remember something I should not forget<br /><br />Life is here and now, in the present&nbsp;</div><div><br /></div><div>The pain we feel is from the past or the future&nbsp;</div><div>But the life we live is in this moment&nbsp;</div><div>Hope in the future and sorrow in the past</div><div>But the life we live is here<br /><br /><br />We chase a life in the future&nbsp;</div><div>and regret the past&nbsp;</div><div>But the life we live is here&nbsp;</div><div><br /></div><div><b>The raindrop teaches me a lesson&nbsp;</b><b>that,</b></div><div><b>I learn every day Life is here and now</b></div></div><br />",
    "excerpt": "A drop of rain lands on my faceIt feels cold and warm, a sign of grace&nbsp;It slides down from my head to my feet&nbsp;It makes me remember something I should not forgetLife is here and now, in the p...",
    "canonicalUrl": "https://blog.rajkawale.com/2023/08/life-is-here-and-now.html",
    "tags": [
      "Poem"
    ]
  },
  {
    "id": "emotional-pain-part-2",
    "title": "The Pain:  Part- 2",
    "slug": "emotional-pain-part-2",
    "published": "2023-04-08T11:27:00.000Z",
    "content": "You lay down still on the bed and are unable to move or speak. You are trapped in the silent prison of your own mind. You feel every sensation in your body, but you have no control over them. You feel a sharp pain in your head, like a needle piercing your brain. You feel your heart beating slower and harder, squeezing your chest with every contraction. You feel a cold sensation spreading from your heart to the rest of your body, like ice in your veins. You feel waves of energy coursing through your body, but they only make you more aware of your helplessness. You feel it in your bones, your muscles, and your nerves. You feel it in your heart, your lungs, and your brain. Every part of your body is affected by this pain. You feel tears rolling down your cheeks, but you can’t wipe them away. You look calm and composed on the outside, but inside you are screaming for relief. You want to scream until you feel something again. But you can’t, because your body won’t let you. You want to escape from your body and let out all the emotions that have been bottled up. You don’t know how long this will last, or if it will ever end. You are alone with your pain. The person who makes you calm is no longer with you. The people around you do not understand you. You have lost yourself in this agony.<div>In a while, you don’t know when you will fall asleep. When you wake up, you feel a bit more alert than before. You feel some peace, some lightness, and comfort. The pain has faded away for a while. You started feeling a sense of calmness, but now you are afraid of what will happen if it occurs again. And eventually, it will, because we are designed to feel the pain.<div><br /></div><div><br /><div><table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgOqQv_ZH-FvEm3QuzYwXfg4p39PCHUGxfBbRlQQVGSa2QE0VuEC6q68qdF-jD4jI9DdddHMmtWrt6S9O3SM9347bHSwzb484bApK8yEbro0vYk0O65XbhN3motCo_Ogp-m1HWWhBeH4u-pLghGgsm_H9rJcoKmk6oWpQT2MFGY8yTHDCdrJia19K0cTg/s660/emotionalpain%20(1).jpg\" style=\"margin-left: auto; margin-right: auto;\"><img border=\"0\" data-original-height=\"440\" data-original-width=\"660\" height=\"213\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEgOqQv_ZH-FvEm3QuzYwXfg4p39PCHUGxfBbRlQQVGSa2QE0VuEC6q68qdF-jD4jI9DdddHMmtWrt6S9O3SM9347bHSwzb484bApK8yEbro0vYk0O65XbhN3motCo_Ogp-m1HWWhBeH4u-pLghGgsm_H9rJcoKmk6oWpQT2MFGY8yTHDCdrJia19K0cTg/s320/emotionalpain%20(1).jpg\" width=\"320\" /></a></td></tr><tr><td class=\"tr-caption\" style=\"text-align: center;\"><br /></td></tr></tbody></table><br />&nbsp;In a previous article, I wrote that every pain has a source. For physical pain, the source is usually easy to identify and comprehend, but for emotional pain, it is much harder.<br /><br />Let’s explore the source of emotional pain.<br /><br />Recall any past event that causes you pain. As human beings, we are not fully present at the moment; therefore, we struggle to accept and acknowledge things as they are. When the unfortunate event occurred, we formed a belief for ourselves. Those beliefs became the story of our lives, which is served us until now. Over time, we accumulated those stories about ourselves until they began to harm us. Now those stories have become our realities. It’s very easy to rationalize those things, but on an emotional level, we have to face many challenges.<br /><br /><br />The pain we experience is influenced by our story. Our story guides how we react to our pain. Some of us try to avoid it, but it only demands more attention. Some of us try to resist it, but it only comes back stronger. Some of us try to manipulate it, but it only gets worse. Some of us try to suppress it, but it grows more intense. The more we embrace it, the more peaceful it becomes</div><div><br /></div><div>We cannot escape our pain, but we can choose how we connect to it. The pain will be there, but we can choose how to cope. Pain is unavoidable, but suffering is a choice.<br /><br />But what about the pain that has no cure? We need to embrace that pain and learn to live with it.<br /><br /><b>Every pain serves a purpose. </b><br /><br /><br /><br />If you have any experience to share or need any help write to me at rajendrakawale101@gmail.com<br /><br /></div></div></div>",
    "excerpt": "You lay down still on the bed and are unable to move or speak. You are trapped in the silent prison of your own mind. You feel every sensation in your body, but you have no control over them. You feel...",
    "canonicalUrl": "https://blog.rajkawale.com/2023/04/emotional-pain-part-2.html",
    "tags": [
      "Emotions",
      "Mental Health",
      "Pain"
    ]
  },
  {
    "id": "can-pain-be-marvellous-part-1",
    "title": "The Pain: Part-1",
    "slug": "can-pain-be-marvellous-part-1",
    "published": "2023-02-16T13:29:00.000Z",
    "content": "<p>When we are moving around and suddenly our pinky toe bumps up against a wall and a sound erupts from our mouth, or when we are eating and suddenly we bite our tongue and a tear escapes from our eye, we refer to this as a <b>PAIN.&nbsp;</b></p><p>Yet the real question is, what became of those brief moments? We only experience pain in about 5% of our body, and it nearly brings us to tears.</p><p><b>Let's explore.</b></p><p>The ability to experience pain is a biological necessity. But on occasion, you meet someone and get the impression that they aren't feeling any pain, which makes you envious of them. Is this agony justified?&nbsp;</p>But, there is one undervalued aspect of pain: <b>it serves a purpose</b>. yet how?<br /><p>When we tread on our pinky toe in a corner, nociceptor nerves sense tissue damage and transmit a signal to the brain via the spinal cord. Pulling the leg away from the corner, of this contraction will limit further injury.</p>This reflex occurs before the message reaches the brain. Once the pain message arrives, it causes an individual to feel an unpleasant sensation&nbsp;— <b>pain</b>.&nbsp;Our bodies resist this new state since we're unaware of it. Our minds go to the natural condition at that moment.<div><br /></div><div>Nevertheless, when you experience pain in your pinky toe, you immediately alert yourself that this is risky and that you must take care of such painful things and take precautions to ensure that this does not happen again or maybe we also need to strengthen the immunity.</div><div><div class=\"separator\" style=\"clear: both; text-align: center;\"><br /></div><div class=\"separator\" style=\"clear: both; text-align: left;\">For pain, there are 3 things involved as below</div><p>1. <b>Source</b>: The affected tissue in our body<br />2. <b>Interpretation</b>: This determines whether or not the discomfort is pleasant.<br />3. <b>Output</b>:&nbsp;To what extent are we willing to put up with the suffering?</p><p><br /></p><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhgmB_5vGLY2PzwLKqpE05fSI4jRkS9BQbnM2kjTf0WDV3VeW3zbdNYor7w53AloxXMQQoXeL0OzYdKdg8Xdd6ShidhqE1CrUNpq1o0EFREVBNvAi2-VAGc1AFQ9u1N3_ta_SR7lZPRvCC6jt9gE2lBLJNfmmYhcWuS2SpI1ENjvmbgZKaBSaL9azpkbg/s334/Untitled%20Diagram.drawio.png\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"285\" data-original-width=\"334\" height=\"273\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhgmB_5vGLY2PzwLKqpE05fSI4jRkS9BQbnM2kjTf0WDV3VeW3zbdNYor7w53AloxXMQQoXeL0OzYdKdg8Xdd6ShidhqE1CrUNpq1o0EFREVBNvAi2-VAGc1AFQ9u1N3_ta_SR7lZPRvCC6jt9gE2lBLJNfmmYhcWuS2SpI1ENjvmbgZKaBSaL9azpkbg/s320/Untitled%20Diagram.drawio.png\" width=\"320\" /></a></div></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><br /></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><br /></div><div class=\"separator\" style=\"clear: both; text-align: left;\">Everything we've talked about thus far has been physical pain. But what about emotional pain?&nbsp;</div><div class=\"separator\" style=\"clear: both; text-align: left;\"><br /></div><div class=\"separator\" style=\"clear: both; text-align: left;\">Check back soon for the next article.</div><div class=\"separator\" style=\"clear: both; text-align: left;\"><br /></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><br /></div><div class=\"separator\" style=\"clear: both; text-align: left;\"><br /></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><br /></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><br /></div>",
    "excerpt": "When we are moving around and suddenly our pinky toe bumps up against a wall and a sound erupts from our mouth, or when we are eating and suddenly we bite our tongue and a tear escapes from our eye, w...",
    "canonicalUrl": "https://blog.rajkawale.com/2023/02/can-pain-be-marvellous-part-1.html",
    "tags": [
      "Emotions",
      "Mental Health",
      "Pain"
    ]
  },
  {
    "id": "how-do-you-assert-yourself",
    "title": "How do you assert yourself?",
    "slug": "how-do-you-assert-yourself",
    "published": "2023-02-02T10:56:00.000Z",
    "content": "<div class=\"separator\" style=\"clear: both; text-align: center;\"><p style=\"color: #252525; text-align: left;\"><strong>Do you remember your last breakup?</strong></p>\n<div style=\"color: #252525; text-align: left;\">&nbsp;</div>\n<div style=\"color: #252525;\"><div style=\"text-align: left;\">Everyone around you starts helping you with words like \"don't think about her and move on\" or \"she/he is not perfect for us.\" There may be or not a valid reason, but still understanding intellectuals is easier than emotionally.&nbsp;</div><div style=\"text-align: left;\"><span style=\"text-align: center;\">In the same situation, we need emotionally to face guilt, regret, anger, shame, grief, pain, and hidden emotions of which we are not aware.&nbsp;</span></div><div>\n<div>&nbsp;</div>\n<div>\n<div class=\"separator\">&nbsp;<div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhdcGkT1mIGFW7hmnJfD4LWfRY5XJl7srQURHpvClKQFvYRIZzxxEGctUdbqRah4qptDQjfanTApOtzk2YDhB0JaWFTAGOOsdlQTKLJY9zbVSsaDS_P1ZpUz1XS6yVSpSD9hwOAOoGuj76QLrlb-KFCer-J0oELHt2Vdqqd_rnpMLCAHYnkGvDl1XklJw/s698/intelligence_nishalinaik-698x450.jpg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"450\" data-original-width=\"698\" height=\"206\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhdcGkT1mIGFW7hmnJfD4LWfRY5XJl7srQURHpvClKQFvYRIZzxxEGctUdbqRah4qptDQjfanTApOtzk2YDhB0JaWFTAGOOsdlQTKLJY9zbVSsaDS_P1ZpUz1XS6yVSpSD9hwOAOoGuj76QLrlb-KFCer-J0oELHt2Vdqqd_rnpMLCAHYnkGvDl1XklJw/s320/intelligence_nishalinaik-698x450.jpg\" width=\"320\" /></a></div><br /></div>\n<div class=\"separator\">Intellectual VS Emotions&nbsp;</div></div>\n<div class=\"separator\">&nbsp;</div><div class=\"separator\" style=\"text-align: left;\"><br /></div><div class=\"separator\" style=\"text-align: left;\">We know getting high involves drinking alcohol or smoking, but there is another way to get high: constantly seeking quotes or any intellectual vocabulary that helps us to cover up our emotions so that it can at least help us to feel better to some extent. That is why, when we hear any motivational video, we feel better, and sometime later, we come back to normal. Maybe intellectually we are so keen on our solution, but it's very hard to implement in our daily lives. because we don't understand the emotions ourselves.</div>\n<div class=\"separator\">&nbsp;</div><div class=\"separator\" style=\"text-align: left;\"><strong>Let's take one more example:</strong></div>\n<div class=\"separator\">&nbsp;</div><div class=\"separator\" style=\"text-align: left;\">We know how important it is to take care of our physical health by exercising and consuming nutritious food. We can give a list of reasons and benefits for a healthy diet and regular exercise, but most of the time we aren't able to make it happen. It might be that you say it's a matter of habit, priority, or personal interest. But underneath, there is one potential aspect we are mostly unaware of, and that is the emotions that are playing with us.</div>\n<div class=\"separator\" style=\"text-align: left;\">Joining the gym and consuming a healthy diet brings us to uncertainty and our mind freaks out the uncertainty. Going to the gym daily in the same routine makes us bored, which we start hating in the long run.</div>\n<div class=\"separator\">&nbsp;</div>\n<div class=\"separator\" style=\"text-align: left;\"><b>So somewhere we need to little calm and collect our thoughts and feel the moment to understand better what actually going on inside our body and mind emotionally.&nbsp;</b></div>\n<div class=\"separator\">&nbsp;</div>\n<div class=\"separator\" style=\"text-align: left;\">&nbsp;<br /></div>\n</div></div></div>",
    "excerpt": "Do you remember your last breakup? &nbsp; Everyone around you starts helping you with words like \"don't think about her and move on\" or \"she/he is not perfect for us.\" There may be or not a valid reas...",
    "canonicalUrl": "https://blog.rajkawale.com/2023/02/how-do-you-assert-yourself.html",
    "tags": [
      "Emotions",
      "Mental Health"
    ]
  },
  {
    "id": "just-one-more-time",
    "title": "Just one more time…",
    "slug": "just-one-more-time",
    "published": "2023-01-18T11:06:00.000Z",
    "content": "<p style=\"text-align: left;\"></p><div style=\"text-align: justify;\"><br />Have you ever sailed across an Ocean,</div><div style=\"text-align: justify;\">On a sail surrounded by sea with no land in the sight</div><div style=\"text-align: justify;\">Without even the possibility of sighting land for days to come</div><div style=\"text-align: justify;\">To stand at the helm of your destiny,</div><div style=\"text-align: justify;\">I want that one more time.</div><div style=\"text-align: justify;\">I wanna be in the piazza del campo in Siena</div><div style=\"text-align: justify;\">and feel the surge as 10 racehorses go thundering by.&nbsp;</div><div style=\"text-align: justify;\">I want another meal in Paris.</div><div style=\"text-align: justify;\">At L’Ambroise on the place de la loge,&nbsp;</div><div style=\"text-align: justify;\">I want another bottle of wine and then another.&nbsp;</div><div style=\"text-align: justify;\">I want the warmth of a woman in a cool set of sheets,&nbsp;</div><div style=\"text-align: justify;\">One more night of jazz at a Vanguard.</div><div style=\"text-align: justify;\">I want to stand on summits and smoke Cubans,&nbsp;</div><div style=\"text-align: justify;\">and feel the sun on my face for as long as I can.&nbsp;</div><div style=\"text-align: justify;\">Walk on the wall again, climb the tower, ride the river, stare at the frescoes</div><div style=\"text-align: justify;\">I wanna sit in the garden and read one more good book,&nbsp;</div><div style=\"text-align: justify;\">Most of all I wanna sleep.&nbsp;</div><div style=\"text-align: justify;\">I wanna sleep like I slept when I was a boy.&nbsp;</div><div style=\"text-align: justify;\">Give me that…</div><div style=\"text-align: justify;\"><br /></div><div style=\"text-align: justify;\">Just one more time<div class=\"separator\" style=\"clear: both; text-align: center;\"><br /></div></div><p></p><p style=\"text-align: justify;\"><br /></p><p style=\"text-align: justify;\">- The Blacklist&nbsp;</p>",
    "excerpt": "Have you ever sailed across an Ocean,On a sail surrounded by sea with no land in the sightWithout even the possibility of sighting land for days to comeTo stand at the helm of your destiny,I want that...",
    "canonicalUrl": "https://blog.rajkawale.com/2023/01/just-one-more-time.html",
    "tags": []
  },
  {
    "id": "the-art-of-loving",
    "title": "The Art of Loving",
    "slug": "the-art-of-loving",
    "published": "2023-01-13T08:12:00.000Z",
    "content": "<br /><br /> As Erich Fromm States, \"LOVE\" is the answer to the problem of human existence. The best book to understand love. I have always thought and wondered about love. What is love? Is love just feelings or anything else? but this book gives a better understanding of the other aspect of love.&nbsp;<div><br /><div><div><br /><div class=\"separator\" style=\"clear: both; text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjP5dWDHUO2WstGkGB3shwoHbMlugwPAJ9MXzBjqNvhlfQIgZhlGFrcSN39qNqRicsjwq7jBaYBevuoTPjPJVTbrvymQavzFhsX67Y21bZzV6x81Ghw16r4d2CdHDQTDpSffpwd2irwv6saA6esIacf4gNyl3msgd4HYmdPS9-XKFtsAYfxFdYRgzeGvw/s475/1613842149542.jpeg\" imageanchor=\"1\" style=\"margin-left: 1em; margin-right: 1em;\"><img border=\"0\" data-original-height=\"475\" data-original-width=\"316\" height=\"320\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjP5dWDHUO2WstGkGB3shwoHbMlugwPAJ9MXzBjqNvhlfQIgZhlGFrcSN39qNqRicsjwq7jBaYBevuoTPjPJVTbrvymQavzFhsX67Y21bZzV6x81Ghw16r4d2CdHDQTDpSffpwd2irwv6saA6esIacf4gNyl3msgd4HYmdPS9-XKFtsAYfxFdYRgzeGvw/s320/1613842149542.jpeg\" width=\"213\" /></a></div><div class=\"separator\" style=\"clear: both; text-align: center;\">The Art of Loving</div><br /><br /></div><div>In the book, Erich Fromm described love from its origin and the essence of love in our life. From the origin of the human species, we are doing misconceptions about love. The separation, aloneness, drug intake, and other aspects are affected by the ignorance of love.</div><div><br /></div><div>Erich Fromm really gives a basic understanding of love like it consists of care, respect, responsibility, and knowledge about each other. Also, love is about choice, commitment, and promise. Love is the activity, it is something I resonate with very deeply.</div><div><br />Three conditions represent falling in love, being in love, and standing in love. In today's society, we get confused with love, sex, intimacy, and emotions and it's important in our daily life. It gives another way to understand and importance of sex in the love life. We can also get to know the difference between motherly love, fatherly love, brotherly love, self-love, and God love.</div></div></div>",
    "excerpt": "As Erich Fromm States, \"LOVE\" is the answer to the problem of human existence. The best book to understand love. I have always thought and wondered about love. What is love? Is love just feelings or a...",
    "canonicalUrl": "https://blog.rajkawale.com/2023/01/the-art-of-loving.html",
    "tags": [
      "Book Review"
    ]
  },
  {
    "id": "you-are-not-alone",
    "title": "Am I Lier?",
    "slug": "you-are-not-alone",
    "published": "2022-12-29T09:02:00.000Z",
    "content": "How are you ?.<div>I am doing great !! What about you?&nbsp;</div><div><br /></div><div>Maybe we miss the morning bus, or we had a terrible night's sleep or we saw our ex got engaged with another cool person but still we are okay. Who gives the f**k. That is also right who gives it?&nbsp;</div><div><br /></div><div>The truth is WE DO.&nbsp;</div><div><br /></div><div>We need to tell ourselves a little more of the truth because we pay too high a price for our lies. Through our deceptions, we cut ourselves off from possibilities of growth. We shut off large portions of our minds and end up uncreative, tetchy, and defensive.&nbsp;</div><div><br /></div><div>We choose to be okay because&nbsp;<b>Perfectionism </b>strives for us. How can be we in misery if everyone around us is so perfectly living?&nbsp;&nbsp;</div><div><br /></div><div><br /></div><div><br /></div><div><table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi7A__fzFpdaAEUnDmoVQ9U6H40StEE7Sd0RxRSV0w7Ofr0FdbFH4MWx1ZL1OiiKLVZqgLn8pvr-9JWg8tS6RWf0zi_u2ArlUwAfmVw6khj8dZt018NKx_tv1Or7Z8MLasOa9k9EBPOaEo4g6XdXY7rJew1Ek2xjxpjV5XH9yDr606H9yogU0KSmB01sA/s1024/Let_go_of_perfectionism_ruminating-1024x692.webp\" imageanchor=\"1\" style=\"margin-left: auto; margin-right: auto;\"><img border=\"0\" data-original-height=\"692\" data-original-width=\"1024\" height=\"216\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEi7A__fzFpdaAEUnDmoVQ9U6H40StEE7Sd0RxRSV0w7Ofr0FdbFH4MWx1ZL1OiiKLVZqgLn8pvr-9JWg8tS6RWf0zi_u2ArlUwAfmVw6khj8dZt018NKx_tv1Or7Z8MLasOa9k9EBPOaEo4g6XdXY7rJew1Ek2xjxpjV5XH9yDr606H9yogU0KSmB01sA/w320-h216/Let_go_of_perfectionism_ruminating-1024x692.webp\" width=\"320\" /></a></td></tr><tr><td class=\"tr-caption\" style=\"text-align: center;\">Is everyone PERFECT?</td></tr></tbody></table><br /></div><div><br /></div><div><br /></div><div><br /></div><div>We think (me too) everyone has beautiful life and enjoys the luxuries of life. Sharing a great picture on Instagram or putting the status with cool clothes and a bunch of unknown friends.</div><div><br /></div><div>Other times the beloved person rejects us due to choosing the other amazing person and we think they are so PERFECT in their life and we are in a terrible.&nbsp;&nbsp;</div><div><p>But the truth is there is nothing PERFECT person. There is merely a differently tricky one. Everyone has their set of problems.&nbsp;</p><p>We don't know the person but we know the human being.&nbsp;</p></div><div><br /></div><div>&nbsp;</div>",
    "excerpt": "How are you ?.I am doing great !! What about you?&nbsp;Maybe we miss the morning bus, or we had a terrible night's sleep or we saw our ex got engaged with another cool person but still we are okay. Wh...",
    "canonicalUrl": "https://blog.rajkawale.com/2022/12/you-are-not-alone.html",
    "tags": [
      "Authenticity",
      "Mental Health"
    ]
  },
  {
    "id": "the-mysterious-product",
    "title": "The Mysterious Product",
    "slug": "the-mysterious-product",
    "published": "2022-12-24T11:30:00.000Z",
    "content": "<p style=\"text-align: left;\"><br /></p>\n<p style=\"text-align: left;\">Recently, I went to one of the ceremonies and sat near a tree. Adjacent to me sat one woman. She discussed lots of things with her spouse, and I was observing their discussion quietly. While she was sharing, suddenly at one point came where she said, \"How are humans so beautifully unique? Everyone has the same hands, legs, and ears, but no one is the same\"</p>\n<p style=\"text-align: left;\"><br /></p><table align=\"center\" cellpadding=\"0\" cellspacing=\"0\" class=\"tr-caption-container\" style=\"margin-left: auto; margin-right: auto;\"><tbody><tr><td style=\"text-align: center;\"><a href=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhQsq_IQu9IIXvVkSvCOK6YDVc1Lz-eu7cYpP2mYEjeThORJKhl3pFx5AO5ihzRxFDyGs9VaXIg7l5bD4Sg3Dsxzr9OcaMr2NGkTtg-Wrjj0btTVjH-ueUevTge3HTNdBcgc0uF3C-Itf8DcHvMJj2BoQEClxi-ZvJKQQP5g_AmZVYCAmxNvcMoFmp3Uw/s1024/adam-eve-temptation-fruit-apple-1-1024x640.jpg\" imageanchor=\"1\" style=\"margin-left: auto; margin-right: auto;\"><img border=\"0\" data-original-height=\"640\" data-original-width=\"1024\" height=\"200\" src=\"https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhQsq_IQu9IIXvVkSvCOK6YDVc1Lz-eu7cYpP2mYEjeThORJKhl3pFx5AO5ihzRxFDyGs9VaXIg7l5bD4Sg3Dsxzr9OcaMr2NGkTtg-Wrjj0btTVjH-ueUevTge3HTNdBcgc0uF3C-Itf8DcHvMJj2BoQEClxi-ZvJKQQP5g_AmZVYCAmxNvcMoFmp3Uw/s320/adam-eve-temptation-fruit-apple-1-1024x640.jpg\" width=\"320\" /></a></td></tr><tr><td class=\"tr-caption\" style=\"text-align: center;\">Adam and Eva</td></tr></tbody></table><div class=\"separator\" style=\"clear: both; text-align: center;\"><br /></div><div class=\"separator\" style=\"clear: both; text-align: center;\"><p style=\"text-align: left;\">Definitely, we learn lots of things in biology. But to the&nbsp;extent, the question was so profound as a product. How can such a design has&nbsp;been built?</p><p style=\"text-align: left;\">The best product ever - Living Things Mostly.</p><p style=\"text-align: left;\">Definitely, over a period of time, lots of QA has been done and lots of releases also happened.</p><p style=\"text-align: left;\">Whatever we are today it's&nbsp;the&nbsp;latest version.</p></div><br /><p style=\"text-align: left;\"><br /></p><p style=\"text-align: left;\"><br /></p>",
    "excerpt": "Recently, I went to one of the ceremonies and sat near a tree. Adjacent to me sat one woman. She discussed lots of things with her spouse, and I was observing their discussion quietly. While she was s...",
    "canonicalUrl": "https://blog.rajkawale.com/2022/12/the-mysterious-product.html",
    "tags": [
      "Product Management"
    ]
  }
]